{
  "lessons": [
    {
      "title": "Lektion 1",
      "entries": [
        {
          "title": "Bootstrap Start",
          "description": "Started playing around with Bootstrap - created the website framework for the Informatik Modul."
        },
        {
          "title": "OneNote Struktur",
          "description": "Created the OneNote file structure for the module."
        },
        {
          "title": "Lexikon Arbeit",
          "description": "Worked through a list of words, split them into three categories, and then explained the words."
        }
      ]
    },
    {
      "title": "Lektion 2",
      "entries": [
        {
          "title": "HTML-Entities",
          "description": "Unsichtbare Zeichensteuerung. HTML verwendet bestimmte Zeichen wie <, > oder & für Tags und Befehle. Damit diese Zeichen korrekt als Text erscheinen, nutzt man sogenannte HTML-Entities. < wird zu &lt; > wird zu &gt; & wird zu &amp; \" wird zu &quot; ' wird zu &apos; (nicht HTML4 kompatibel). Es gibt auch spezielle Entities wie &shy; für weiche Trennstriche oder &zwj; für Nullbreiten-Verbindungen."
        },
        {
          "title": "Relative vs. Absolute Links",
          "description": "Absolute Links enthalten die komplette URL (z. B. https://example.com/page.html) und funktionieren überall. Relative Links sind kürzer (z. B. ../seite.html) und funktionieren nur innerhalb derselben Webseite. Absolut: \"https://example.com/home\" (überall gültig). Relativ: \"../home\" (nur innerhalb derselben Ordnerstruktur gültig)."
        },
        {
          "title": "CSS-Einheiten",
          "description": "em, vw und vh. em: Bezieht sich auf die Schriftgröße des Eltern-Elements. Kann kaskadieren, was zu unerwarteten Effekten führt. vw (Viewport Width): 1% der Breite des Browserfensters. vh (Viewport Height): 1% der Höhe des Browserfensters. Problem: Mobile Browser verändern die Höhe von 100vh, wenn die Adressleiste ein- oder ausgeblendet wird. Lösung: 100lvh verwenden, falls verfügbar."
        },
        {
          "title": "Float als Layout-Werkzeug",
          "description": "Das alte Layout-Werkzeug. Float wurde ursprünglich für Textfluss um Bilder entwickelt, aber lange für komplette Webseiten-Layouts missbraucht. Heutzutage nutzt man besser Flexbox oder Grid. float: right; lässt ein Element nach rechts fließen, der Text läuft links daneben weiter. Problem: Float-Elemente werden nicht von ihren Eltern-Containern berücksichtigt, weshalb der clearfix-Hack oder overflow: hidden; nötig war. Lösung: Stattdessen display: flex; oder display: grid; verwenden."
        },
        {
          "title": "Task One Reflection",
          "description": "I found the easy parts, such as most of the CSS except the centering, manageable. However, I faced challenges due to my inability to read the task properly, which led to mistakes. Centering elements became a frustrating task as I slipped into full auto mode, implementing features I didn't need. I struggled to adapt to another person's coding style and intentions, making it difficult to align my work with theirs."
        }
      ]
    }
  ]
}
